app/controllers/food_courts_controller.rb

  def index

    #@food_courts = FoodCourt.all
    @sort = params[:sort] || session[:sort]
    @food_court = FoodCourt.order(@sort)
---
SELECT "food_courts".* FROM "food_courts"  ORDER BY foodCourt

  def show
    id = params[:session][:id]
    @food_court = FoodCourt.find(id)
---
SELECT  "food_courts".* FROM "food_courts" WHERE "food_courts"."id" = ? LIMIT 1  [["id", 1]]

  def edit
        @food_court = FoodCourt.find params[:id]
---
SELECT  "food_courts".* FROM "food_courts" WHERE "food_courts"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @food_court = FoodCourt.new(food_court_params)

    respond_to do |format|
      if @food_court.save
---
INSERT INTO "food_courts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-05-10 17:09:13.556712"], ["updated_at", "2016-05-10 17:09:13.556712"]]

    def set_food_court
      @food_court = FoodCourt.find(params[:id])
---
SELECT  "food_courts".* FROM "food_courts" WHERE "food_courts"."id" = ? LIMIT 1  [["id", 1]]