app/controllers/food_outlets_controller.rb

SELECT "food_outlets".* FROM "food_outlets" WHERE "food_outlets"."outletId" = ?  [["outletId", "2"]]
---
  def show

    @idOutlet = params[:id]
    @food_outlets = FoodOutlet.where(outletId:@idOutlet)

SELECT  "food_outlets".* FROM "food_outlets" WHERE "food_outlets"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_food_outlet
      @food_outlet = FoodOutlet.find(params[:id])