app/controllers/menu_lists_controller.rb

SELECT "menu_lists".* FROM "menu_lists"
---
  def index
    @menu_list = MenuList.all

INSERT INTO "menu_lists" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-04-25 15:22:06.304591"], ["updated_at", "2016-04-25 15:22:06.304591"]]
---
  def create
    @menu_list = MenuList.new(menu_list_params)

    respond_to do |format|
      if @menu_list.save

DELETE FROM "menu_lists" WHERE "menu_lists"."id" = ?  [["id", 1]]
---
  def destroy
    @menu_list.destroy

SELECT  "menu_lists".* FROM "menu_lists" WHERE "menu_lists"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_menu_list
      @menu_list = MenuList.find(params[:id])