app/controllers/reviews_and_ratings_controller.rb

SELECT "reviews_and_ratings".* FROM "reviews_and_ratings"
---
  def index
    @reviews_and_ratings = ReviewsAndRating.all

INSERT INTO "reviews_and_ratings" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-05-10 16:48:59.349693"], ["updated_at", "2016-05-10 16:48:59.349693"]]
---
  def create
    @reviews_and_rating = ReviewsAndRating.new(reviews_and_rating_params)

    respond_to do |format|
      if @reviews_and_rating.save

SELECT  "reviews_and_ratings".* FROM "reviews_and_ratings" WHERE "reviews_and_ratings"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_reviews_and_rating
      @reviews_and_rating = ReviewsAndRating.find(params[:id])